<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<link rel="stylesheet" href="./css/common.css">
<meta charset="UTF-8">
<title>회원 약관 및 동의</title>
<style>
.content { width:1200px; margin:150px auto 100px auto; text-align:right;}
h3 { padding:10px; text-align:center; }
button { padding:10px 20px 10px 20px; float:right; }
textarea { margin-bottom:10px; }
</style>
</head>
<body>
	<header id="hd">
		<div class="hd_wrap">
			<%@ include file="nav.jsp" %>
		</div>
	</header>
	<div class="content">
	<h3>회원약관</h3>
	<textarea rows="70" cols="170" readonly>

제1조(목적) 이 약관은 회사가 온라인으로 제공하는 디지털콘텐츠(이하 "콘텐츠"라고 한다) 및 제반서비스의 이용과 관련하여 회사와 이용자와의 권리, 의무 및 책임사항 등을 규정함을 목적으로 합니다. 
 제2조(정의) 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.   
1. "회사"라 함은 "콘텐츠" 산업과 관련된 경제활동을 영위하는 자로서 콘텐츠 및 제반서비스를 제공하는 자를 말합니다. 

2. "이용자"라 함은 "회사"의 사이트에 접속하여 이 약관에 따라 "회사"가 제공하는 "콘텐츠" 및 제반서비스를 이용하는 회원 및 비회원을 말합니다. 

3. "회원"이라 함은 "회사"와 이용계약을 체결하고 "이용자" 아이디(ID)를 부여받은 "이용자"로서 "회사"의 정보를 지속적으로 제공받으며 "회사"가 제공하는 서비스를 지속적으로 이용할 수 있는 자를 말합니다. 

4. "비회원"이라 함은 "회원"이 아니면서 "회사"가 제공하는 서비스를 이용하는 자를 말합니다. 

5. "콘텐츠"라 함은 정보통신망이용촉진 및 정보보호 등에 관한 법률 제2조 제1항 제1호의 규정에 의한 정보통신망에서 사용되는 부호·문자·음성·음향·이미지 또는 영상 등으로 표현된 자료 또는 정보로서, 그 보존 및 이용에 있어서 효용을 높일 수 있도록 전자적 형태로 제작 또는 처리된 것을 말합니다. 

6. "아이디(ID)"라 함은 "회원"의 식별과 서비스이용을 위하여 "회원"이 정하고 "회사"가 승인하는 문자 또는 숫자의 조합을 말합니다. 

7. "비밀번호(PASSWORD)"라 함은 "회원"이 부여받은 "아이디"와 일치되는 "회원"임을 확인하고 비밀보호를 위해 "회원" 자신이 정한 문자 또는 숫자의 조합을 말합니다. 

 제3조(신원정보 등의 제공) "회사"는 이 약관의 내용, 상호, 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호 및 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 온라인 서비스초기화면에 게시합니다. 다만, 약관은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다. 
 제4조(약관의 게시 등)   ① "회사"는 이 약관을 "회원"이 그 전부를 인쇄할 수 있고 거래과정에서 해당 약관의 내용을 확인할 수 있도록 기술적 조치를 취합니다. 
② "회사"는 "이용자"가 "회사"와 이 약관의 내용에 관하여 질의 및 응답할 수 있도록 기술적 장치를 설치합니다. 

③ "회사"는 "이용자"가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회, 환불조건 등과 같은 중요한 내용을 이용자가 쉽게 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공하여 "이용자"의 확인을 구합니다. 

 제5조(약관의 개정 등)   ① "회사"는 온라인 디지털콘텐츠산업 발전법, 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다. 
② "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 서비스초기화면에 그 적용일자 7일 이전부터 적용일 후 상당한 기간동안 공지하고, 기존회원에게는 개정약관을 전자우편주소로 발송합니다. 

③ "회사"가 약관을 개정할 경우에는 개정약관 공지 후 개정약관의 적용에 대한 "이용자"의 동의 여부를 확인합니다. "이용자"가 개정약관의 적용에 동의하지 않는 경우 "회사" 또는 "이용자"는 콘텐츠 이용계약을 해지할 수 있습니다. 이때, "회사"는 계약해지로 인하여 "이용자"가 입은 손해를 배상합니다. 

 제6조(약관의 해석) 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 온라인 디지털콘텐츠산업 발전법, 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률, 문화체육관광부장관이 정하는 디지털콘텐츠이용자보호지침, 기타 관계법령 또는 상관례에 따릅니다. 
       제2장 회원가입

 제7조(회원가입)   ① 회원가입은 "이용자"가 약관의 내용에 대하여 동의를 하고 회원가입신청을 한 후 "회사"가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 
② 회원가입신청서에는 다음 사항을 기재해야 합니다. 1호 내지 3호의 사항은 필수사항이며, 그 외의 사항은 선택사항입니다. 

1. "회원"의 성명과 주민등록번호 또는 인터넷상 개인식별번호 

2. "아이디"와 "비밀번호" 

3. 전자우편주소 

4. 이용하려는 "콘텐츠"의 종류 

5. 기타 "회사"가 필요하다고 인정하는 사항 

③ "회사"는 상기 "이용자"의 신청에 대하여 회원가입을 승낙함을 원칙으로 합니다. 다만, "회사"는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않을 수 있습니다. 

1. 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우 

2. 실명이 아니거나 타인의 명의를 이용한 경우 

3. 허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우 

4. 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우 

④ "회사"는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다. 

⑤ 제3항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, "회사"는 이를 신청자에게 알려야 합니다. "회사"의 귀책사유 없이 신청자에게 통지할 수 없는 경우에는 예외로 합니다. 

⑥ 회원가입계약의 성립 시기는 "회사"의 승낙이 "이용자"에게 도달한 시점으로 합니다. 
</textarea><br>
<input type="checkbox" name="ck1" id="ck1" > 회원약관에 동의합니다.
<br><br><br>
<h3>개인정보처리방침</h3>
<textarea rows="70" cols="170" readonly>

제1조(개인정보의 처리목적)
국가법령정보센터는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

국가법령정보센터 관리
처리목적: 국가법령 공동 활용
운영근거: 법제처직제 시행규칙
※ 좀더 상세한 법제처의 개인정보파일 등록사항 공개는 행정안전부 개인정보보호 포털(http://www.privacy.go.kr/) → 민원마당 → 개인정보열람등 요구 → 개인정보파일 목록검색 메뉴를 활용해 주시기 바랍니다.

제2조(개인정보의 처리 및 보유기간)
국가법령정보센터는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
보유기간: 2년
제3조(개인정보의 제3자 제공)
국가법령정보센터는 원칙적으로 정보주체의 개인정보를 수집·이용 목적으로 명시한 범위 내에서 처리하며, 다음의 경우를 제외하고는 정보주체의 사전 동의 없이는 본래의 목적 범위를 초과하여 처리하거나 제3자에게 제공하지 않습니다.

정보주체로부터 별도의 동의를 받은 경우
다른 법률에 특별한 규정이 있는 경우
정보주체 또는 그 법정대리인이 의사표시를 할 수 없는 상태에 있거나 주소불명 등으로 사전 동의를 받을 수 없는 경우로서 명백히 정보주체 또는 제3자의 급박한 생명, 신체, 재산의 이익을 위하여 필요하다고 인정되는 경우
통계작성 및 학술연구 등의 목적을 위하여 필요한 경우로서 특정 개인을 알아볼 수 없는 형태로 개인정보를 제공하는 경우
개인정보를 목적 외의 용도로 이용하거나 이를 제3자에게 제공하지 아니하면 다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우로서 보호위원회의 심의ㆍ의결을 거친 경우
조약, 그 밖의 국제협정의 이행을 위하여 외국정부 또는 국제기구에 제공하기 위하여 필요한 경우
범죄의 수사와 공소의 제기 및 유지를 위하여 필요한 경우
법원의 재판업무 수행을 위하여 필요한 경우
형(刑) 및 감호, 보호처분의 집행을 위하여 필요한 경우
제4조(개인정보처리의 위탁)
국가법령정보센터는 개인정보의 처리업무를 위탁하는 경우 다음의 내용이 포함된 문서에 의하여 처리하고 있습니다.

위탁업무 수행 목적 외 개인정보의 처리 금지에 관한 사항
개인정보의 관리적·기술적 보호조치에 관한 사항
개인정보의 안전관리에 관한 사항
위탁업무의 목적 및 범위, 재위탁 제한에 관한 사항, 개인정보 안전성 확보 조치에 관한 사항, 위탁업무와 관련하여 보유하고 있는 개인정보의 관리현황점검 등 감독에 관한 사항, 수탁자가 준수하여야 할 의무를 위반한 경우의 손해배상책임에 관한 사항
국가법령정보센터는 원활한 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.

파일명
- 국가법령정보센터
- 상위법령개정알림
위탁 업무의 내용
해당 홈페이지 유지보수 수행
- 응용프로그램 서비스 제공
- 기술적 보호조치 등
수탁업체명 :(주)비인텍
제5조(정보주체의 권리·의무 및 행사방법)
정보주체는 국가법령정보센터에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
개인정보 열람 요구
오류 등이 있을 경우 정정 요구
삭제요구
처리정지 요구
제1항에 따른 권리 행사는 국가법령정보센터에 대해 서면, 전화, 전자우편, 모사전송(fax) 등을 통하여 하실 수 있으며 국가법령정보센터는 이에 대해 지체없이 조치하겠습니다.
정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 국가법령정보센터는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.
제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
정보주체는 개인정보 보호법 등 관계법령을 위반하여 국가법령정보센터가 처리하고 있는 정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니됩니다.
제6조(처리하는 개인정보 항목)
국가법령정보센터는 다음의 개인정보 항목을 처리하고 있습니다.

국가법령정보센터 관리
회사/단체명, 사용자아이디, 이메일주소, 성명, 연락처
서비스 이용과정에서 아래와 같은 정보들이 자동으로 생성되어 수집 될 수 있습니다.
브라우져 종류, os, 방문일시, ip주소, 도메인주소, 방문전 웹사이트 주소 등
제7조(개인정보의 파기)
국가법령정보센터는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보(또는 개인정보파일)를 별도의 데이터베이스(db)로 옮기거나 보관장소를 달리하여 보존합니다.
개인정보 파기의 절차 및 방법은 다음과 같습니다.
파기절차
국가법령정보센터는 파기하여야 하는 개인정보(또는 개인정보파일)에 대해 개인정보 파기계획을 수립하여 파기합니다. 국가법령정보센터는 파기 사유가 발생한 개인정보(또는 개인정보파일)를 선정하고, 국가법령정보센터는 개인정보 보호책임자의 승인을 받아 개인정보(또는 개인정보파일)를 파기합니다.
파기방법
국가법령정보센터는 전자적 파일 형태로 기록․저장된 개인정보는 기록을 재생할 수 없도록 로우레밸포멧(low level format) 등의 방법을 이용하여 파기하며, 종이 문서에 기록․저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
</textarea><br>
<input type="checkbox" name="ck2" id="ck2"> 개인정보처리방침에 동의합니다.
<br><br><br>
<button id="btn1" onclick="fnc1()">회원가입</button>
</div>
<script type="text/javascript">
	function fnc1(){
		var ck1 = document.getElementById("ck1");
		var ck2 = document.getElementById("ck2")
		if(ck1.checked && ck2.checked) {
			location.href = "join.jsp";
			return false;
		} else {
			alert("약관에 동의하지 않으셨습니다.");
			return false;
		}
	}
</script>
<footer id="ft">
	<%@ include file="ft.jsp" %>
</footer>
</body>
</html>